# Задайте последовательность чисел. Напишите программу,
# которая выведет список неповторяющихся элементов исходной последовательности.
#  Не использовать множества.

numbers = [1, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4]


def get_unique_numbers(numbers):
    unique = []
    for number in numbers:
        if number not in unique:
            unique.append(number)
    return unique


print(get_unique_numbers(numbers))
